;; Org
(package! org-pomodoro)
(package! org-modern)
(package! org-tree-slide)
(package! org-auto-tangle)
(package! org-super-agenda)
(package! consult-org-roam)
(package! svg-tag-mode)
(package! ox-typst)

;; Icons
(package! nerd-icons)
(package! nerd-icons-dired)
(package! nerd-icons-completion)
(package! nerd-icons-ibuffer)
(package! all-the-icons)

;; UI
(package! rainbow-delimiters)
(package! olivetti)
(package! imenu-list)
(package! focus)

;; Utilities
(package! openwith)

;; light theme
(package! south-theme
  :recipe (:host github
           :repo "SophieBosio/south"))


(package! awqat
  :recipe (:host github
           :repo "zkry/awqat"))

;; Typst
(package! typst-ts-mode
  :recipe (:host nil
           :repo "https://git.sr.ht/~meow_king/typst-ts-mode"))
(package! ox-typst)

(package! ox-reveal)
(package! tmr)

(package! gt)
(package! ssh-agency)
(package! bluetooth)
